{"class_name": "Model", "config": {"name": "FaceRecoModel", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 96, 96], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "zero_padding2d_47", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_47", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_47", 0, 0, {}]]]}, {"name": "bn1", "class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_75", "class_name": "Activation", "config": {"name": "activation_75", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_48", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_48", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_75", 0, 0, {}]]]}, {"name": "max_pooling2d_13", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["zero_padding2d_48", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"name": "bn2", "class_name": "BatchNormalization", "config": {"name": "bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "activation_76", "class_name": "Activation", "config": {"name": "activation_76", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_49", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_49", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_49", 0, 0, {}]]]}, {"name": "bn3", "class_name": "BatchNormalization", "config": {"name": "bn3", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "activation_77", "class_name": "Activation", "config": {"name": "activation_77", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3", 0, 0, {}]]]}, {"name": "zero_padding2d_50", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_50", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_77", 0, 0, {}]]]}, {"name": "max_pooling2d_14", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["zero_padding2d_50", 0, 0, {}]]]}, {"name": "inception_3a_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_3a_3x3_conv1", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"name": "inception_3a_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_3a_5x5_conv1", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"name": "inception_3a_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3a_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_3a_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3a_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_78", "class_name": "Activation", "config": {"name": "activation_78", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_80", "class_name": "Activation", "config": {"name": "activation_80", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_5x5_bn1", 0, 0, {}]]]}, {"name": "max_pooling2d_15", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_15", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"name": "zero_padding2d_51", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_51", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_78", 0, 0, {}]]]}, {"name": "zero_padding2d_52", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_52", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_80", 0, 0, {}]]]}, {"name": "inception_3a_pool_conv", "class_name": "Conv2D", "config": {"name": "inception_3a_pool_conv", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_15", 0, 0, {}]]]}, {"name": "inception_3a_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_3a_3x3_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_51", 0, 0, {}]]]}, {"name": "inception_3a_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_3a_5x5_conv2", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_52", 0, 0, {}]]]}, {"name": "inception_3a_pool_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3a_pool_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_pool_conv", 0, 0, {}]]]}, {"name": "inception_3a_1x1_conv", "class_name": "Conv2D", "config": {"name": "inception_3a_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"name": "inception_3a_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3a_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_3a_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3a_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_5x5_conv2", 0, 0, {}]]]}, {"name": "activation_82", "class_name": "Activation", "config": {"name": "activation_82", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_pool_bn", 0, 0, {}]]]}, {"name": "inception_3a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3a_1x1_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_1x1_conv", 0, 0, {}]]]}, {"name": "activation_79", "class_name": "Activation", "config": {"name": "activation_79", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_81", "class_name": "Activation", "config": {"name": "activation_81", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_53", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_53", "trainable": true, "padding": [[3, 4], [3, 4]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_82", 0, 0, {}]]]}, {"name": "activation_83", "class_name": "Activation", "config": {"name": "activation_83", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_1x1_bn", 0, 0, {}]]]}, {"name": "concatenate_15", "class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_79", 0, 0, {}], ["activation_81", 0, 0, {}], ["zero_padding2d_53", 0, 0, {}], ["activation_83", 0, 0, {}]]]}, {"name": "inception_3b_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_3b_3x3_conv1", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "inception_3b_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_3b_5x5_conv1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "inception_3b_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3b_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_3b_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3b_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_84", "class_name": "Activation", "config": {"name": "activation_84", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_86", "class_name": "Activation", "config": {"name": "activation_86", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_5x5_bn1", 0, 0, {}]]]}, {"name": "average_pooling2d_9", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_9", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "zero_padding2d_54", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_54", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_84", 0, 0, {}]]]}, {"name": "zero_padding2d_55", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_55", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_86", 0, 0, {}]]]}, {"name": "inception_3b_pool_conv", "class_name": "Conv2D", "config": {"name": "inception_3b_pool_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}]]]}, {"name": "inception_3b_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_3b_3x3_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_54", 0, 0, {}]]]}, {"name": "inception_3b_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_3b_5x5_conv2", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_55", 0, 0, {}]]]}, {"name": "inception_3b_pool_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3b_pool_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_pool_conv", 0, 0, {}]]]}, {"name": "inception_3b_1x1_conv", "class_name": "Conv2D", "config": {"name": "inception_3b_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "inception_3b_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3b_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_3b_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3b_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_5x5_conv2", 0, 0, {}]]]}, {"name": "activation_88", "class_name": "Activation", "config": {"name": "activation_88", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_pool_bn", 0, 0, {}]]]}, {"name": "inception_3b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3b_1x1_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_1x1_conv", 0, 0, {}]]]}, {"name": "activation_85", "class_name": "Activation", "config": {"name": "activation_85", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_87", "class_name": "Activation", "config": {"name": "activation_87", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_56", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_56", "trainable": true, "padding": [[4, 4], [4, 4]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_88", 0, 0, {}]]]}, {"name": "activation_89", "class_name": "Activation", "config": {"name": "activation_89", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_1x1_bn", 0, 0, {}]]]}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_85", 0, 0, {}], ["activation_87", 0, 0, {}], ["zero_padding2d_56", 0, 0, {}], ["activation_89", 0, 0, {}]]]}, {"name": "inception_3c_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_3c_3x3_conv1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "inception_3c_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_3c_5x5_conv1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "inception_3c_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3c_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_3c_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3c_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_90", "class_name": "Activation", "config": {"name": "activation_90", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_92", "class_name": "Activation", "config": {"name": "activation_92", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_5x5_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_57", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_57", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_90", 0, 0, {}]]]}, {"name": "zero_padding2d_58", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_58", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_92", 0, 0, {}]]]}, {"name": "inception_3c_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_3c_3x3_conv2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_57", 0, 0, {}]]]}, {"name": "inception_3c_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_3c_5x5_conv2", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_58", 0, 0, {}]]]}, {"name": "inception_3c_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3c_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_3c_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3c_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_5x5_conv2", 0, 0, {}]]]}, {"name": "max_pooling2d_16", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_16", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "activation_91", "class_name": "Activation", "config": {"name": "activation_91", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_93", "class_name": "Activation", "config": {"name": "activation_93", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_59", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_59", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_16", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_91", 0, 0, {}], ["activation_93", 0, 0, {}], ["zero_padding2d_59", 0, 0, {}]]]}, {"name": "inception_4a_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_4a_3x3_conv1", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "inception_4a_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_4a_5x5_conv1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "inception_4a_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4a_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_4a_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4a_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_94", "class_name": "Activation", "config": {"name": "activation_94", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_96", "class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_5x5_bn1", 0, 0, {}]]]}, {"name": "average_pooling2d_10", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_10", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "zero_padding2d_60", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_60", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_94", 0, 0, {}]]]}, {"name": "zero_padding2d_61", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_61", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_96", 0, 0, {}]]]}, {"name": "inception_4a_pool_conv", "class_name": "Conv2D", "config": {"name": "inception_4a_pool_conv", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_10", 0, 0, {}]]]}, {"name": "inception_4a_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_4a_3x3_conv2", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_60", 0, 0, {}]]]}, {"name": "inception_4a_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_4a_5x5_conv2", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_61", 0, 0, {}]]]}, {"name": "inception_4a_pool_bn", "class_name": "BatchNormalization", "config": {"name": "inception_4a_pool_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_pool_conv", 0, 0, {}]]]}, {"name": "inception_4a_1x1_conv", "class_name": "Conv2D", "config": {"name": "inception_4a_1x1_conv", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "inception_4a_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4a_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_4a_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4a_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_5x5_conv2", 0, 0, {}]]]}, {"name": "activation_98", "class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_pool_bn", 0, 0, {}]]]}, {"name": "inception_4a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "inception_4a_1x1_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_1x1_conv", 0, 0, {}]]]}, {"name": "activation_95", "class_name": "Activation", "config": {"name": "activation_95", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_97", "class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_62", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_62", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_98", 0, 0, {}]]]}, {"name": "activation_99", "class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_1x1_bn", 0, 0, {}]]]}, {"name": "concatenate_18", "class_name": "Concatenate", "config": {"name": "concatenate_18", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_95", 0, 0, {}], ["activation_97", 0, 0, {}], ["zero_padding2d_62", 0, 0, {}], ["activation_99", 0, 0, {}]]]}, {"name": "inception_4e_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_4e_3x3_conv1", "trainable": true, "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"name": "inception_4e_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_4e_5x5_conv1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"name": "inception_4e_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4e_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4e_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_4e_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4e_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4e_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_100", "class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4e_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_102", "class_name": "Activation", "config": {"name": "activation_102", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4e_5x5_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_63", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_63", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_100", 0, 0, {}]]]}, {"name": "zero_padding2d_64", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_64", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_102", 0, 0, {}]]]}, {"name": "inception_4e_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_4e_3x3_conv2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_63", 0, 0, {}]]]}, {"name": "inception_4e_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_4e_5x5_conv2", "trainable": true, "filters": 128, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_64", 0, 0, {}]]]}, {"name": "inception_4e_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4e_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4e_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_4e_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4e_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": 